{
    "version": "https://jsonfeed.org/version/1",
    "title": "Frostfire Media",
    "description": "",
    "home_page_url": "https://frostfire.io",
    "feed_url": "https://frostfire.io/feed.json",
    "user_comment": "",
    "icon": "https://frostfire.io/media/website/Frostfire-Light-Text-Short-512.png",
    "author": {
        "name": "Shane Clark"
    },
    "items": [
        {
            "id": "https://frostfire.io/auctions-update.html",
            "url": "https://frostfire.io/auctions-update.html",
            "title": "Auctions Update",
            "summary": "We've been busy looking into new ways to integrate the Auctions plugin with a web-based GUI. We're currently working on Java WebSockets, and looking into the potential of using service workers to allow push notifications to be sent when a bid is ending, or when&hellip;",
            "content_html": "<p>We've been busy looking into new ways to integrate the Auctions plugin with a web-based GUI. We're currently working on Java WebSockets, and looking into the potential of using service workers to allow push notifications to be sent when a bid is ending, or when you have been outbid.</p>\n<p>These features will require a server to be running HTTPS, however do not require intensive server-side processing.</p>\n<p>We are also looking into the possibility of utilizing custom advancement messages for notifications. If that proves fruitful, we will develop a custom AdvancementAPI for ease of use in other plugins.</p>\n<p>Development is incredibly slow thanks to real life events having to take precedence, however we will continue working on Frostfire Auctions.</p>",
            "author": {
                "name": "Shane Clark"
            },
            "tags": [
            ],
            "date_published": "2019-09-14T04:18:57-06:00",
            "date_modified": "2019-09-14T04:18:57-06:00"
        },
        {
            "id": "https://frostfire.io/the-magic-pack-launch.html",
            "url": "https://frostfire.io/the-magic-pack-launch.html",
            "title": "The Magic Pack Launch",
            "summary": "The rework of Frostfire Magic has culminated in our revamped, and redesigned Magic Pack. This pack will be for the 1.7.10 version of Minecraft. It has been carefully designed to run smoothly, even on laptops with integrated graphics. Optifine brings a FPS boost, as well&hellip;",
            "content_html": "<p>The rework of Frostfire Magic has culminated in our revamped, and redesigned Magic Pack. This pack will be for the 1.7.10 version of Minecraft. It has been carefully designed to run smoothly, even on laptops with integrated graphics. Optifine brings a FPS boost, as well as unparalleled options to Minecraft.</p>\n<p>We hope that this modpack stands the test of time, and continues to show that Minecraft isn't as boring as it is portrayed to be.</p>\n<p>Check out the official website of <a href=\"https://the-magic-pack.ml/\" target=\"_blank\" rel=\"noopener noreferrer\">The Magic Pack</a>.</p>",
            "author": {
                "name": "Shane Clark"
            },
            "tags": [
                   "Minecraft"
            ],
            "date_published": "2019-06-09T06:36:43-06:00",
            "date_modified": "2019-06-09T06:36:43-06:00"
        },
        {
            "id": "https://frostfire.io/frostfire-magic-rework.html",
            "url": "https://frostfire.io/frostfire-magic-rework.html",
            "title": "Frostfire Magic Rework",
            "summary": "We've taken down the old Frostfire Magic modpack, and reworked the entire modpack to load faster, run faster, and feel smoother. We are planning on releasing it through Technic's Solder application, however for the time being it will be hosted through Bitbucket's LFS system. If&hellip;",
            "content_html": "<p>We've taken down the old Frostfire Magic modpack, and reworked the entire modpack to load faster, run faster, and feel smoother. We are planning on releasing it through Technic's Solder application, however for the time being it will be hosted through Bitbucket's LFS system.</p>\n<p>If you're interested in playing the new version, you can find all the information on our Frostfire Magic page, by either using the navigation bar, or clicking HERE.</p>",
            "author": {
                "name": "Shane Clark"
            },
            "tags": [
                   "Minecraft"
            ],
            "date_published": "2019-06-08T00:47:50-06:00",
            "date_modified": "2019-06-08T01:36:56-06:00"
        },
        {
            "id": "https://frostfire.io/launch.html",
            "url": "https://frostfire.io/launch.html",
            "title": "Launch",
            "summary": "As of today, we have a new website. Hosted on Bitbucket until further notice, and using simple static pages to reduce load times, as well as offer better mobile support. This will be the location for all announcements, as well as updates on any of&hellip;",
            "content_html": "<p>As of today, we have a new website. Hosted on Bitbucket until further notice, and using simple static pages to reduce load times, as well as offer better mobile support.</p>\n<p>This will be the location for all announcements, as well as updates on any of our projects.</p>\n<p>We apologize for not having a proper website for upward of a year while many of our projects were on hiatus.</p>",
            "author": {
                "name": "Shane Clark"
            },
            "tags": [
                   "Announcements"
            ],
            "date_published": "2019-06-07T21:39:54-06:00",
            "date_modified": "2019-09-14T03:03:09-06:00"
        }
    ]
}
